Core/src/src/DataProcessors/AzRyАвтоматизацияНачисленияИВыдачиЗарплаты/AzRyАвтоматизацияНачисленияИВыдачиЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRyАвтоматизацияНачисленияИВыдачиЗарплаты</name>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНачисленияДивиденд</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНачисленияЗарплаты</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНачисленияПенсия</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНДФЛДивиденд</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектНДФЛЗапрлаты</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУдержаниеПенсия</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУдержаниеПитание</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУдержаниеСтраховка</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийНачисленийПенсии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийНачисленийСтраховки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийНачисленийПитания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПлВед</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаРасхСоСчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистраций</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНачисленияJiraТариф</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыДокументов</name>
  </attributes>
  <attributes>
    <name>СоздатьДокументНачислениеЗарплаты</name>
    <comment>Начисление зарплаты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьДокументПлатежнаяВедомость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьДокументРасходСоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкНомерСчета</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>JiraProject</name>
    <type>
      <types>CatalogRef.AzRyJiraProject</types>
    </type>
  </attributes>
  <attributes>
    <name>СгенерироватьРепорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьСотрудники</name>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисляемЗарплату</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыплаченнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
    <attributes>
      <name>Jira</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>JiraProject</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧастьСотрудникиНалог</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСотрудника</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата1</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата2</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРабДнейМесяца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зарплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зарплата2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗарплатаЗаОдинДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗарплатаИтог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Catalogs/AzRyНастройки/AzRyНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AzRyНастройки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Ecommerce</name>
      <description>Ecommerce</description>
    </items>
    <items>
      <name>jira</name>
      <description>Jira</description>
      </content>
    </items>
    <items>
      <name>RS_GE</name>
      <description>RS_GE</description>
    </items>
    <items>
      <name>ГруппаДокументы</name>
      <description>ГруппаДокументы</description>
    </items>
    <items>
      <name>Другие</name>
      <description>Другие</description>
    </items>
    <items>
      <name>КоректировкаПроведенийДокументов</name>
      <description>Коректировка проведений документов</description>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>НачисленияУдержания</name>
      <description>Начисления удержания</description>
    </items>
    <items>
      <name>ОперацийСНоменклатурой</name>
      <description>Операций с номенклатурой</description>
    </items>
    <items>
      <name>РаспределитьРасходы</name>
      <description>Распределить расходы</description>
    </items>
    <items>
      <name>ЧекККМ</name>
      <description>Чек ККМ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
      <types>ChartOfAccountsRef.Управленческий</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.НаправленияДеятельности</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>CatalogRef.Организации</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Календари</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтроковоеЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/DataProcessors/AzRyАвтоматизацияНачисленияИВыдачиЗарплаты/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

//&НаСервере
//Перем ПараметрыДокументов;

&НаСервере
Перем МассивНалога;

&НаКлиенте
Перем ЗаголовокНачислений;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СтатусОбработки = "Создание";
	
	НачатьТранзакцию();	
	Попытка
		Ответ = ОбработкаОбъект.ВыполнитьКомандуНаСервереСС(ОбработкаОбъект.ТабличнаяЧастьСотрудники.Выгрузить());
	Исключение
		ОтменитьТранзакцию();
		Сообщить("დოკუმენტების დაფორმირება ვერ მოხერხდა....!" + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);	
		Возврат;
	КонецПопытки;	
	//ЗафиксироватьТранзакцию();
	
	ДокументыНачислений.Очистить();
	ДокументыПлатежнаяВедомость.Очистить();
	ДокументыРасходСоСчета.Очистить();
	
	// 1) Начислений
	Для каждого ТекСтрока Из Ответ.СписокДокНачисление Цикл
		Если Не ТекСтрока.Значение.Проведен Тогда
			Продолжить;	
		КонецЕсли; 
		СтруктураИтогов = ТекСтрока.Значение.ПолучитьСуммуДокумента();
		НовСтрока = ДокументыНачислений.Добавить();
		НовСтрока.ДокументСсылка = ТекСтрока.Значение.Ссылка;
		НовСтрока.Подразделение  = ТекСтрока.Значение.СтруктурнаяЕдиница;
		НовСтрока.Начислено = СтруктураИтогов.СуммаНачислено;
		НовСтрока.Удержано = СтруктураИтогов.СуммаУдержано;
		НовСтрока.СуммаВыдачи = СтруктураИтогов.СуммаДокумента;
	КонецЦикла;			
			
	// 2) ПлатежнаяВедомость
	Для каждого ТекДок Из Ответ.МассивДокОбектПлатежнаяВедомость Цикл	
		НовСтрока = ДокументыПлатежнаяВедомость.Добавить();
		НовСтрока.ДокументСсылка = ТекДок.Ссылка;
		НовСтрока.СуммаДокумента = ТекДок.СуммаДокумента;		
		НовСтрока.Коментарий     = ТекДок.Комментарий;
	КонецЦикла;

	// 3) РасходСоСчета
	Для каждого ТекДок2 Из Ответ.МассивДокОбектРасходСоСчета Цикл	
		НовСтрока = ДокументыРасходСоСчета.Добавить();
		НовСтрока.ДокументСсылка = ТекДок2.Ссылка;
		НовСтрока.СуммаДокумента = ТекДок2.СуммаДокумента;
		НовСтрока.Коментарий     = ТекДок2.Комментарий;
	КонецЦикла;
	
	ОбновитьПодвалТаблиц();
	
	Сообщить("ოპერაცია დასრულდა წარმატებით.", СтатусСообщения.Информация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗСотрудникамиСервер(ОчиститьТаблицы)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТЗСотрудникамиСерверCC(ОчиститьТаблицы);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиДанныеВТаблицахФорм(ОбработкаОбъект, ТаблицыНачисленийИНалогов)
	
	// Переносим данные в таблицу объекта "ТабличнаяЧастьСотрудники"
	ТаблицыНачисленийИНалогов.НачисленияУдержания.Сортировать("jira Убыв, Сотрудник Убыв");
	Для каждого ТекСтрока Из ТаблицыНачисленийИНалогов.НачисленияУдержания Цикл	
		НоваяСтрока = ОбработкаОбъект.ТабличнаяЧастьСотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
	КонецЦикла;
	
	// Переносим данные в таблицу объекта "ТабличнаяЧастьСотрудникиНалог"
	ТаблицыНачисленийИНалогов.Налог.Сортировать("Сотрудник Убыв");
	Для каждого ТекСтрока2 Из ТаблицыНачисленийИНалогов.Налог Цикл	
		НоваяСтрока = ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока2);	
	КонецЦикла;
	
	// Переносим данные в таблицу объекта "ИсторияСотрудника"
	ТаблицыНачисленийИНалогов.ИсторияЗарплаты.Сортировать("Сотрудник Убыв");
	ОбработкаОбъект.ИсторияСотрудника.Очистить();
	Для каждого ТекСтрока2 Из ТаблицыНачисленийИНалогов.ИсторияЗарплаты Цикл	
		НоваяСтрока = ОбработкаОбъект.ИсторияСотрудника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока2);	
	КонецЦикла;
	
КонецПроцедуры
 
&НаСервере
Процедура НЗПриИзмененииСервер()
	
	// Реквизит Формы В Значение
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Перенисем данные в таблицу объекта "ТабличнаяЧастьСотрудники"
	Для каждого ТекСтрока Из ОбработкаОбъект.ТабличнаяЧастьСотрудники Цикл
		ТекСтрока.НачисляемЗарплату = НЗ;		
	КонецЦикла;
	
	// Значение В Реквизит Формы
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтчетСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");    
	ПараметрыДокументов = ОбработкаОбъект.ПараметрыЗапускаCC();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗНачисления.Сотрудник,
	               |	ТЗНачисления.ВидНачисленияУдержания КАК ВидыНачисленийИУдержаний,
	               |	ТЗНачисления.Тип,
	               |	ТЗНачисления.Сумма КАК СуммаНачислений
	               |ПОМЕСТИТЬ ТЗНачислений
	               |ИЗ
	               |	&ТЗНачисления КАК ТЗНачисления
	               |ГДЕ
	               |	ТЗНачисления.Тип = &ТипНачисления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗУдержания.Сотрудник,
	               |	ТЗУдержания.ВидНачисленияУдержания КАК ВидыНачисленийИУдержаний,
	               |	ТЗУдержания.Тип,
	               |	ТЗУдержания.Сумма КАК СуммаУдержаний
	               |ПОМЕСТИТЬ ТЗУдержания
	               |ИЗ
	               |	&ТЗУдержания КАК ТЗУдержания
	               |ГДЕ
	               |	ТЗУдержания.Тип = &ТипУдержания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗВыданнаяСумма.Сотрудник,
	               |	""ВЫПСУММА"" КАК ВидыНачисленийИУдержаний,
	               |	ТЗВыданнаяСумма.Тип,
	               |	ТЗВыданнаяСумма.ВыплаченнаяСумма
	               |ПОМЕСТИТЬ ТЗВыданнаяСумма
	               |ИЗ
	               |	&ТЗВыданнаяСумма КАК ТЗВыданнаяСумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗНалог.Сотрудник,
	               |	ТЗНалог.Налог КАК ВидыНачисленийИУдержаний,
	               |	ТЗНалог.Тип,
	               |	ТЗНалог.Сумма КАК СуммаНалога
	               |ПОМЕСТИТЬ ТЗНалог
	               |ИЗ
	               |	&ТЗНалог КАК ТЗНалог
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	               |	ВложенныйЗапрос.ВидыНачисленийИУдержаний,
	               |	ВложенныйЗапрос.СуммаНачислений КАК СуммаНачислений,
	               |	ВложенныйЗапрос.СуммаУдержаний КАК СуммаУдержаний,
	               |	ВложенныйЗапрос.СуммаНалога КАК СуммаНалога,
	               |	ВложенныйЗапрос.ВыплаченнаяСумма КАК ВыплаченнаяСумма,
	               |	ВложенныйЗапрос.СуммаНачислений - ВложенныйЗапрос.СуммаУдержаний - ВложенныйЗапрос.СуммаНалога КАК СуммаВыдачи
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТЗНачислений.Сотрудник КАК Сотрудник,
	               |		ТЗНачислений.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний,
	               |		ТЗНачислений.Тип КАК Тип,
	               |		ТЗНачислений.СуммаНачислений КАК СуммаНачислений,
	               |		0 КАК СуммаУдержаний,
	               |		0 КАК СуммаНалога,
	               |		0 КАК ВыплаченнаяСумма
	               |	ИЗ
	               |		ТЗНачислений КАК ТЗНачислений
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗУдержания.Сотрудник,
	               |		ТЗУдержания.ВидыНачисленийИУдержаний,
	               |		ТЗУдержания.Тип,
	               |		0,
	               |		ТЗУдержания.СуммаУдержаний,
	               |		0,
	               |		0
	               |	ИЗ
	               |		ТЗУдержания КАК ТЗУдержания
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗНалог.Сотрудник,
	               |		ТЗНалог.ВидыНачисленийИУдержаний,
	               |		ТЗНалог.Тип,
	               |		0,
	               |		0,
	               |		ТЗНалог.СуммаНалога,
	               |		0
	               |	ИЗ
	               |		ТЗНалог КАК ТЗНалог
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТЗВыданнаяСумма.Сотрудник,
	               |		ТЗВыданнаяСумма.ВидыНачисленийИУдержаний,
	               |		ТЗВыданнаяСумма.Тип,
	               |		0,
	               |		0,
	               |		0,
	               |		ТЗВыданнаяСумма.ВыплаченнаяСумма
	               |	ИЗ
	               |		ТЗВыданнаяСумма КАК ТЗВыданнаяСумма) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СуммаНачислений УБЫВ
	               |ИТОГИ
	               |	СУММА(СуммаНачислений),
	               |	СУММА(СуммаУдержаний),
	               |	СУММА(СуммаНалога),
	               |	СУММА(ВыплаченнаяСумма),
	               |	СУММА(СуммаВыдачи)
	               |ПО
	               |	Сотрудник";
				   
	ТЗпараметры = ФилтрацияТЗОтчета(ОбработкаОбъект.ТабличнаяЧастьСотрудники, ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог);			   
				   
	Запрос.УстановитьПараметр("ТЗНачисления", ТЗпараметры.ТЗ1);
	Запрос.УстановитьПараметр("ТЗУдержания", ТЗпараметры.ТЗ1);
	Запрос.УстановитьПараметр("ТЗВыданнаяСумма", ТЗпараметры.ТЗ1);
	Запрос.УстановитьПараметр("ТЗНалог", ТЗпараметры.ТЗ2);
	
	Запрос.УстановитьПараметр("ТипНачисления", Перечисления.ТипыНачисленийИУдержаний.Начисление);	
	Запрос.УстановитьПараметр("ТипУдержания", Перечисления.ТипыНачисленийИУдержаний.Удержание);
		
	//Результат = Запрос.Выполнить().Выгрузить();
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
	Дерево = Результат.Выгрузить(СпособОбхода); 
	
	ОбработкаОбъект.Отчет = Неопределено;
	ОбработкаОбъект.Отчет = Дерево;
	
	// Значение В Реквизит Формы
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

// При изменений сотруднику начисление надо обновыть таблицу НДФЛ Сотрудника
&НаСервере
Процедура ТабличнаяЧастьСотрудникиСуммаПриИзмененииСервер(Сотрудник)
	
	//ტარიფის ცვლილებისას უნდა განახლდეს საპენსიოს მნიშვნელობებიც	
	ОбработкаОбъект     = РеквизитФормыВЗначение("Объект");
	ПараметрыДокументов = ОбработкаОбъект.ПараметрыЗапускаCC();
	
	// 1) Отбор таблицы "ТабличнаяЧастьСотрудники"
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", Сотрудник);
	
	МассивСтрок = ОбработкаОбъект.ТабличнаяЧастьСотрудники.НайтиСтроки(Отбор);
	
	СуммаНачислений = 0;
	ПенсияЗначение  = 0;
	СоотВ = ОбработкаОбъект.СоответствиеТарифнаяСтавка(ОбработкаОбъект.ТабличнаяЧастьСотрудники, ПараметрыДокументов.ОбъектНачисленияЗарплаты);
	Для каждого ТекСтрока Из МассивСтрок Цикл	
			
		// დაგროვებითი საპენსიოს გამოთვლა
		Если ПенсияЗначение = 0 Тогда
			ПенсияЗначение = ОбработкаОбъект.ПенсияВычислить(ТекСтрока, ТекСтрока.ВидНачисленияУдержания, СоотВ[ТекСтрока.Сотрудник]);	
		КонецЕсли; 
		
		// 
		Если ТекСтрока.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Начисление И ТекСтрока.ВидНачисленияУдержания <> Справочники.AzRyНастройки.НачислениеПенсия.Значение Тогда
			СуммаНачислений = СуммаНачислений + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ВидНачисленияУдержания = Справочники.AzRyНастройки.УдержаниеПенсия.Значение Или ТекСтрока.ВидНачисленияУдержания = Справочники.AzRyНастройки.НачислениеПенсия.Значение Тогда			
			ТекСтрока.Сумма = ПенсияЗначение;
		ИначеЕсли ТекСтрока.ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
			//СуммаНачислений = СуммаНачислений - ТекСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	
	// 2) Отбор таблицы "ТабличнаяЧастьСотрудникиНалог"
	МассивСтрок2 = ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог.НайтиСтроки(Отбор);
	Если МассивСтрок2.Количество() = 0 Тогда
		НоваяСтрока = ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник; 
		НоваяСтрока.Налог     = Объект.ОбъектНДФЛЗапрлаты;
		НоваяСтрока.Сумма     = 0;
		НоваяСтрока.Тип       = Объект.ОбъектНДФЛЗапрлаты.Тип;
		
		МассивСтрок2 = ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог.НайтиСтроки(Отбор);
	КонецЕсли; 
	
	Для каждого ТекСтрока2 Из МассивСтрок2 Цикл	
		ТекСтрока2.Сумма = (СуммаНачислений - ПенсияЗначение) * ПараметрыДокументов.ПроцентНДФЛ/100;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КоментарийДокументов()
	    
	Если Объект.ВидНачисления = "I_Половина" Тогда 
		Объект.Коментарий = "ავტ. დარიცხვა : " + ЗаголовокНачислений + " I ნახევარი";
		Объект.КоментарийНачисленийСтраховки = "ავტ. : ჯანდაცვა I ნახევარი";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება I ნახევარი";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია I ნახევარი";
	ИначеЕсли Объект.ВидНачисления = "II_Половина" Тогда
		Объект.Коментарий = "ავტ. დარიცხვა : " + ЗаголовокНачислений + " II ნახევარი";
		Объект.КоментарийНачисленийСтраховки = "ავტ. დარიცხვა : ჯანდაცვა II ნახევარი";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება II ნახევარი";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია II ნახევარი";
	ИначеЕсли Объект.ВидНачисления = "Зарплата" Тогда
		Объект.Коментарий = "ავტ. დარიცხვა : " + ЗаголовокНачислений + " სრული";
		Объект.КоментарийНачисленийСтраховки = "ავტ. დარიცხვა : ჯანდაცვა სრული";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება სრული";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია სრული";
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображенияТекста()
		
	Если Объект.ВидНачисления = "I_Половина" Тогда 
		Элементы.Декорация3.Заголовок = ЗаголовокНачислений + " I ნახევარი";
		Объект.КоментарийНачисленийСтраховки = "ავტ. დარიცხვა : ჯანდაცვა I ნახევარი";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება I ნახევარი";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია I ნახევარი";		
	ИначеЕсли Объект.ВидНачисления = "II_Половина" Тогда
		Элементы.Декорация3.Заголовок = ЗаголовокНачислений + " II ნახევარი";
		Объект.КоментарийНачисленийСтраховки = "ავტ. დარიცხვა : ჯანდაცვა II ნახევარი";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება II ნახევარი";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია II ნახევარი";		
	ИначеЕсли Объект.ВидНачисления = "Зарплата" Тогда
		Элементы.Декорация3.Заголовок = "სრული " + ЗаголовокНачислений;
		Объект.КоментарийНачисленийСтраховки = "ავტ. დარიცხვა : ჯანდაცვა სრული";
		Объект.КоментарийНачисленийПитания   = "ავტ. დარიცხვა : კვება სრული";
		Объект.КоментарийНачисленийПенсии    = "ავტ. დარიცხვა : პენსია სრული";
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ФилтрацияТЗОтчета(_ТабличнаяЧастьСотрудники, _ТабличнаяЧастьСотрудникиНалог)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗВремТаблица.ЗанимаемыхСтавок,
		|	ТЗВремТаблица.НачисляемЗарплату,
		|	ТЗВремТаблица.Сотрудник,
		|	ТЗВремТаблица.Должность,
		|	ТЗВремТаблица.ГрафикРаботы,
		|	ТЗВремТаблица.Валюта,
		|	ТЗВремТаблица.ВидНачисленияУдержания,
		|	ТЗВремТаблица.Сумма,
		|	ТЗВремТаблица.СчетЗатрат,
		|	ТЗВремТаблица.ВыплаченнаяСумма,
		|	ТЗВремТаблица.Тип
		|ПОМЕСТИТЬ ТЗВремТаблица
		|ИЗ
		|	&ТЗВремТаблица КАК ТЗВремТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗВремТаблица.ЗанимаемыхСтавок,
		|	ТЗВремТаблица.НачисляемЗарплату,
		|	ТЗВремТаблица.Сотрудник,
		|	ТЗВремТаблица.Должность,
		|	ТЗВремТаблица.ГрафикРаботы,
		|	ТЗВремТаблица.Валюта,
		|	ТЗВремТаблица.ВидНачисленияУдержания,
		|	ТЗВремТаблица.Сумма,
		|	ТЗВремТаблица.СчетЗатрат,
		|	ТЗВремТаблица.Тип,
		|	ТЗВремТаблица.ВыплаченнаяСумма
		|ИЗ
		|	ТЗВремТаблица КАК ТЗВремТаблица
		|ГДЕ
		|	ТЗВремТаблица.НачисляемЗарплату = ИСТИНА";

	Запрос.УстановитьПараметр("ТЗВремТаблица", _ТабличнаяЧастьСотрудники);
		
	ТЗ1 = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗВремТаблица.Сотрудник,
	|	ТЗВремТаблица.Налог,
	|	ТЗВремТаблица.Сумма,
	|	ТЗВремТаблица.Тип
	|ПОМЕСТИТЬ ТЗВремТаблица2
	|ИЗ
	|	&ТЗВремТаблица2 КАК ТЗВремТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗВремТаблица2.Сотрудник,
	|	ТЗВремТаблица2.Налог,
	|	ТЗВремТаблица2.Сумма,
	|	ТЗВремТаблица2.Тип
	|ИЗ
	|	ТЗВремТаблица2 КАК ТЗВремТаблица2
	|ГДЕ
	|	ТЗВремТаблица2.Сотрудник В(&Сотрудник)";
	
	Запрос.УстановитьПараметр("ТЗВремТаблица2", _ТабличнаяЧастьСотрудникиНалог);
	Запрос.УстановитьПараметр("Сотрудник", ТЗ1.ВыгрузитьКолонку("Сотрудник"));
	
	ТЗ2 = Запрос.Выполнить().Выгрузить();


	СтрПараметры = Новый Структура;
	СтрПараметры.Вставить("ТЗ1", ТЗ1);
	СтрПараметры.Вставить("ТЗ2", ТЗ2);
	
	Возврат СтрПараметры;
	
КонецФункции	

&НаСервере
Функция ФилтрацияТЗ(ТЗ, КолонкаФилтр, ПарамФилтр)

	НовТЗ = ТЗ.Скопировать();
	МассивПарам = Новый Массив;
	
	Для каждого ТекСтрока Из НовТЗ Цикл
	
		Если Не ТекСтрока[КолонкаФилтр] = ПарамФилтр Тогда 
			МассивПарам.Добавить(ТекСтрока);
		КонецЕсли;	
	
	КонецЦикла;
	
	
	Для каждого ТекМассив Из МассивПарам Цикл
	
		НовТЗ.Удалить(ТекМассив); 
	
	КонецЦикла;	
	
	Возврат НовТЗ;

КонецФункции // 

&НаСервере
Функция ГенерацияТаблицНачисленийИНалогов(ОбработкаОбъект)
	
	МассивСотрудники = Неопределено;
	Элементы.СотрудникиОтчет.Доступность = Ложь;
	ТЗСотрудникиJira = Новый СписокЗначений;	
	СотрудникиИзДжираИНеИзДжира = Новый Структура;
	СотрудникиИзДжираИНеИзДжира.Вставить("спДжира", Новый СписокЗначений);
	СотрудникиИзДжираИНеИзДжира.Вставить("спНеДжира", Новый СписокЗначений);
	
	ТЗСотрудники = AzRyFunctions.АктивныеСотрудники(КонецДня(Объект.ПараметрыДокументов.ДатаДокумента), Объект.Организация, Объект.Подразделение, МассивСотрудники);
	ТЗСотрудники.Колонки.Добавить("Jira", Новый ОписаниеТипов("Строка"));
	
	Если Объект.ТипНачисленияJiraТариф = "jira" Тогда 
				
		МассивСотрудники = AzRyFunctions.АктивныеСотрудникиДжира(Объект.ПараметрыДокументов.ДатаДокумента).ВыгрузитьКолонку("Сотрудник");
		ТЗСотрудникиJira = AzRyFunctions.АктивныеСотрудники(КонецДня(Объект.ПараметрыДокументов.ДатаДокумента), Объект.Организация, Объект.Подразделение, МассивСотрудники);
		
		// Джира
		Для каждого ТекСтрока Из ТЗСотрудникиJira Цикл
			НайденнаяСтрока = ТЗСотрудники.Найти(ТекСтрока.Сотрудник, "Сотрудник");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = ТЗСотрудники.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Jira = "Jira";
			Иначе 
				НайденнаяСтрока.Jira = "Jira";
			КонецЕсли;
		КонецЦикла;
				
		спДжира   = Новый СписокЗначений;
		спНеДжира = Новый СписокЗначений;
		
		//Для каждого ТекСтрока Из ТЗСотрудникиJira Цикл
		//	спДжира.Добавить(ТекСтрока.Сотрудник);				
		//КонецЦикла;
		Для каждого ТекСтрока Из ТЗСотрудники Цикл
			Если спДжира.НайтиПоЗначению(ТекСтрока.Сотрудник) = Неопределено Тогда
				спНеДжира.Добавить(ТекСтрока.Сотрудник);		
			КонецЕсли; 
		КонецЦикла;	
		
		спДжира.ЗагрузитьЗначения(ТЗСотрудникиJira.ВыгрузитьКолонку("Сотрудник"));
		
		СотрудникиИзДжираИНеИзДжира = Новый Структура;
		СотрудникиИзДжираИНеИзДжира.Вставить("спДжира", спДжира);
		СотрудникиИзДжираИНеИзДжира.Вставить("спНеДжира", спНеДжира);
		
		Элементы.СотрудникиОтчет.Доступность = Истина;
		
	Иначе 	
		
	КонецЕсли;
	
	// ყველა აქტიური თანამშრომლები და თანამშრომლები რომლებსაც დალოგილი აქვთ ჯირაში
	КоличествоВсехСотрудников    = ТЗСотрудники.Количество();
	КоличествоСотрудниковИзДжира = ТЗСотрудникиJira.Количество();
	
	//// 1) 
	//Если ТипНачисленияJiraТариф = "jira" Тогда 
	//	МассивСотрудники = AzRyFunctions.АктивныеСотрудникиДжира(ПараметрыДокументов.ДатаДокумента).ВыгрузитьКолонку("Сотрудник");	
	//КонецЕсли;
	//ТЗАктивныеСотрудники = AzRyFunctions.АктивныеСотрудники(КонецДня(ПараметрыДокументов.ДатаДокумента), Организация, Подразделение, МассивСотрудники);
	
	//// debug test
	//МассивУД = Новый Массив;
	//Для каждого ТекСтрока Из ТЗСотрудники Цикл
	//	Если 			
	//		ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000147")
	//		И ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000465") 
	//		//И ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000385") 
	//		//И ТекСтрока.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("000000179") 
	//		Тогда
	//		
	//		МассивУД.Добавить(ТекСтрока);			
	//	КонецЕсли; 
	//КонецЦикла;
	//
	//Для каждого ТекМассив Из МассивУД Цикл
	//	ТЗСотрудники.Удалить(ТекМассив);
	//КонецЦикла;
	//// debug test 
	
	// 2)
	Возврат ОбработкаОбъект.ВычислитьЗарплатуПоНачислениям(Объект.Организация, ТЗСотрудники, Объект.ПараметрыДокументов.ДатаДокумента, Неопределено, МассивНалога);
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("АдресВХранилище") И ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
		
		СохраненныеНастройки = Новый Структура;
		Для Каждого КлючИЗначение Из Настройки Цикл
			// Преобразование имени для хранения ключа соответствия для хранения в структуре
			ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,".","_QTQ_");
			ИмяКлюча = СтрЗаменить(ИмяКлюча," ","_QPQ_");
			Если ИмяКлюча = "" Тогда
				ИмяКлюча = "_QQQ_";
			КонецЕсли;
			СохраненныеНастройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
		КонецЦикла;
		
		Настройки.Очистить();
		
	Иначе
		
		//ДатаДокумента               = Настройки.Получить("ДатаДокумента");
		//ПериодРегистраций           = Настройки.Получить("ПериодРегистраций");
		Объект.Организация                   = Настройки.Получить("Организация");
		//Подразделение                 = Настройки.Получить("Подразделение");
		Объект.ОбъектНачисленияЗарплаты      = Настройки.Получить("ОбъектНачисленияЗарплаты");
		Объект.ОбъектНДФЛЗапрлаты            = Настройки.Получить("ОбъектНДФЛЗапрлаты");
		Объект.ОбъектНачисленияДивиденд      = Настройки.Получить("ОбъектНачисленияДивиденд");
		Объект.ОбъектНДФЛДивиденд            = Настройки.Получить("ОбъектНДФЛДивиденд");
		Объект.СтатьиДвиженияДенежныхСредств = Настройки.Получить("СтатьиДвиженияДенежныхСредств");
		Объект.Коментарий                    = Настройки.Получить("Коментарий");
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	//Если СохраненныеНастройки <> Неопределено Тогда
	
	СохраненныеНастройки = Новый Соответствие;
	//СохраненныеНастройки.Вставить("ДатаДокумента", ДатаДокумента);
	//СохраненныеНастройки.Вставить("ПериодРегистраций", ПериодРегистраций);
	СохраненныеНастройки.Вставить("Организация", Объект.Организация);
	//СохраненныеНастройки.Вставить("Подразделение", Подразделение);
	СохраненныеНастройки.Вставить("ОбъектНачисленияЗарплаты", Объект.ОбъектНачисленияЗарплаты); 
	СохраненныеНастройки.Вставить("ОбъектНДФЛЗапрлаты", Объект.ОбъектНДФЛЗапрлаты);
	СохраненныеНастройки.Вставить("ОбъектНачисленияДивиденд", Объект.ОбъектНачисленияДивиденд);
	СохраненныеНастройки.Вставить("ОбъектНДФЛДивиденд", Объект.ОбъектНДФЛДивиденд);
	СохраненныеНастройки.Вставить("СтатьиДвиженияДенежныхСредств", Объект.СтатьиДвиженияДенежныхСредств);
	СохраненныеНастройки.Вставить("Коментарий", Объект.Коментарий);
	
	Для Каждого КлючИЗначение Из СохраненныеНастройки Цикл
		// Обратное преобразование имени для хранения ключа соответствия для хранения в структуре
		ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,"_QTQ_",".");
		ИмяКлюча = СтрЗаменить(ИмяКлюча,"_QPQ_"," ");
		Если ИмяКлюча = "_QQQ_" Тогда
			ИмяКлюча = "";
		КонецЕсли;
		Настройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
	КонецЦикла;
		
	//Иначе
	//	
	//	// Сохранение отбора выполняется только если это не печать из документа
	//	Настройки.Вставить("НастройкиОтбора",Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки));
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СоздатьДокументПлатежнаяВедомость = "Да";
	Объект.СоздатьДокументРасходСоСчета      = "Да";
	Объект.СоздатьДокументНачислениеЗарплаты = "Да";
	Объект.ВидНачисления              = "Зарплата";
	Объект.ТипНачисленияJiraТариф            = "Тариф";
	
	Объект.ОбъектНачисленияЗарплаты          = Справочники.AzRyНастройки.НачислениеТарифнаяСтавка.Значение;
	Объект.СчетЗатратНоменклатура            = AzRyFunctions.НаправленияДеятельностиНоменклатура(Объект.ОбъектНачисленияЗарплаты.СчетЗатрат.Наименование);
	Объект.ОбъектНачисленияПенсия            = Справочники.AzRyНастройки.НачислениеПенсия.Значение;
	Объект.ОбъектНДФЛЗапрлаты                = Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение;
	Объект.ОбъектУдержаниеСтраховка          = Справочники.AzRyНастройки.УдержаниеСтраховка.Значение;
	Объект.ОбъектУдержаниеПитание            = Справочники.AzRyНастройки.УдержаниеПитание.Значение;
	Объект.ОбъектУдержаниеПенсия             = Справочники.AzRyНастройки.УдержаниеПенсия.Значение;
	Объект.НаправленияДеятельности           = Справочники.AzRyНастройки.НаправленияДеятельности.Значение;
	
	// Debug 
	Объект.ДатаДокумента            = ТекущаяДата();
	Объект.ДатаДокументаПлВед       = ТекущаяДата();
	Объект.ДатаДокументаРасхСоСчета = ТекущаяДата();
	Объект.ПериодРегистраций        = ТекущаяДата();
	
	Объект.Организация   = Справочники.Организации.ОсновнаяОрганизация;
	////Организация   = Справочники.Организации.НайтиПоКоду("CN-000008");
	
	Сп = Новый СписокЗначений;
	////Сп.Добавить(Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение);
	//Сп.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Software Development Department"));
	//Сп.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Administration Department"));
	Сп.Добавить(Справочники.СтруктурныеЕдиницы.НайтиПоНаименованию("Technical Department"));
	//////
	Объект.Подразделение.ЗагрузитьЗначения(Сп.ВыгрузитьЗначения());
	//////
	ОбновитьДанныеРабочихЧасов();
	// Debug
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Декорация1.Видимость = Ложь;
	
	ЗаголовокНачислений = Элементы.ГруппаТипНачисления.ТекущаяСтраница.Заголовок;
	
	ОбновлениеОтображенияТекста();	
	
	КоментарийДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
		//ДатаДокумента = ДатаДокумента + (60 * 60 * 9);
		
		Если Не ЗначениеЗаполнено(Объект.ПериодРегистраций) Тогда 
			ПериодРегистраций        = Объект.ДатаДокумента;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаДокументаПлВед) Тогда 
			ДатаДокументаПлВед       = Объект.ДатаДокумента;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ДатаДокументаРасхСоСчета) Тогда 
			ДатаДокументаРасхСоСчета = Объект.ДатаДокумента;
		КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НЗПриИзменении(Элемент)
	НЗПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСотрудникиСуммаПриИзменении(Элемент)
		
	ТекДанные = Элементы.ТабличнаяЧастьСотрудники.ТекущиеДанные;
	ТабличнаяЧастьСотрудникиСуммаПриИзмененииСервер(ТекДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСотрудникиВидНачисленияУдержанияПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ТабличнаяЧастьСотрудники.ДанныеСтроки(Элементы.ТабличнаяЧастьСотрудники.ТекущаяСтрока);
	
	ДанныеСтроки.Тип = ТабличнаяЧастьСотрудникиВидНачисленияУдержанияПриИзмененииСервер(ДанныеСтроки.ВидНачисленияУдержания);
	
КонецПроцедуры	

&НаСервере
Функция ТабличнаяЧастьСотрудникиВидНачисленияУдержанияПриИзмененииСервер(Ссылка)
	
    Тип = Ссылка.Тип;	
	
	Возврат Тип;
	
КонецФункции

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаОтчет" Тогда 
		ВыполнитьОтчетСервер();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция КоличествоЗаписейВТЗ()

	// Реквизит Формы В Значение
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат Не ОбработкаОбъект.ТабличнаяЧастьСотрудники.Количество() = 0;

КонецФункции
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	ВыполнитьКомандуНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗСотрудниками(Команда)
	
	// Вопрос
	Если КоличествоЗаписейВТЗ() Тогда 	
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "ru = ""Очистить таблицу начисления и удержания?"";"
		+ " ka = ""მოხდეს დარიცხვა დაკავებების ცხრილის გასუფთავება?""";
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТЗСотрудникамиЗавершение", ЭтаФорма), НСтр(Текст), Режим, 0);
        Возврат;
	Иначе 
		ОтветТЗ = Ложь;
	КонецЕсли;
	
	ЗаполнитьТЗСотрудникамиФрагмент(ОтветТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗСотрудникамиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	//Ответ = РезультатВопроса;
	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	ОтветТЗ = Истина;
	//Иначе 	
	//	ОтветТЗ = Ложь;
	//КонецЕсли;
	
	ЗаполнитьТЗСотрудникамиФрагмент(РезультатВопроса = КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЗСотрудникамиФрагмент(Знач ОчиститьТаблицы)
	
	ЗаполнитьТЗСотрудникамиСервер(ОчиститьТаблицы);
	НЗ = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтчет(Команда)
	
	ВыполнитьОтчетСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	
	ЗаполнитьТЗСотрудникамиСервер(Истина);
	ВыполнитьОтчетСервер();
	
	КоментарийДокументов();
	ОбновлениеОтображенияТекста();
	
	НЗ = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПлатежнаяВедомостьПриИзменении(Элемент)
	
	Если Объект.СоздатьДокументПлатежнаяВедомость = "Нет" Тогда 
		Элементы.СоздатьДокументРасходСоСчета.Доступность = Ложь;
	Иначе 
		Элементы.СоздатьДокументРасходСоСчета.Доступность = Истина;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбновитьДанныеРабочихЧасов()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ДанныеРабочихЧасов(Объект.ПериодРегистраций);
	КоличествоРабочихДней = Ответ.КРДВ;

КонецПроцедуры
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ


&НаКлиенте
Процедура ТабличнаяЧастьСотрудникиНалогПриИзменении(Элемент)
	
	ВыполнитьОтчетСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСотрудникиСотрудникПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабличнаяЧастьСотрудники.ТекущиеДанные;
	
	ТекДанные.Должность = РеквизитСотрудника(ТекДанные.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаТипНачисленияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЗаголовокНачислений = ТекущаяСтраница.Заголовок;
	
	ОбновлениеОтображенияТекста();
	
	КоментарийДокументов();
	
КонецПроцедуры

&НаСервере
Функция РеквизитСотрудника(СотрудникСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК СотрудникиСрезПоследних";

	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Объект.ПериодРегистраций));
	Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);

	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи[0].Должность;

КонецФункции // РеквизитСотрудника()

&НаКлиенте
Процедура ПериодРегистрацийПриИзменении(Элемент)
	ПериодРегистрацийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодРегистрацийПриИзмененииНаСервере()
	
	ОбновитьДанныеРабочихЧасов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНачисленияЗарплатыПриИзменении(Элемент)
	НаправленияДеятельностиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаправленияДеятельностиПриИзмененииНаСервере()
	
	//Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаправлениеДеятельностыНоменклатура, Истина);
	//Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
	//	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	//	Номенклатура.УстановитьНовыйКод();
	//	Номенклатура.Наименование            = НаправлениеДеятельностыНоменклатура;
	//	Номенклатура.НаименованиеПолное      = НаправлениеДеятельностыНоменклатура;
	//	//Номенклатура.Артикул                 = СтрокаАртикул;
	//	Номенклатура.ТипНоменклатуры         = Перечисления.ТипыНоменклатуры.Запас;
	//	Номенклатура.НоменклатурнаяГруппа    = Справочники.НоменклатурныеГруппы.ОсновнаяГруппа;
	//	Номенклатура.ЕдиницаИзмерения        = Справочники.КлассификаторЕдиницИзмерения.шт;
	//	Номенклатура.СтавкаНДС               = Справочники.СтавкиНДС.НайтиПоНаименованию("18%");
	//	Номенклатура.Комментарий             = "გამოიყენება ხელფასების დარიცხვაში დამარებულ რეგისტრში 'შესყიდვები'";
	//	Номенклатура.Записать();		
	//КонецЕсли;
	//НаправленияДеятельностиНом = Номенклатура.Ссылка;
	
	Объект.СчетЗатратНоменклатура = AzRyFunctions.НаправленияДеятельностиНоменклатура(Объект.ОбъектНачисленияЗарплаты.СчетЗатрат.Наименование);
	
КонецПроцедуры 

&НаКлиенте
Процедура Декорация7Нажатие(Элемент)
	ТабДокумент = Новый ТабличныйДокумент;
	Декорация7НажатиеНаСервере(ТабДокумент);
	ТабДокумент.Показать("Пользователи");
КонецПроцедуры

&НаСервере
Процедура Декорация7НажатиеНаСервере(ТабДокумент)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("თანამშრომლები_ჯირადან", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), "თანამშრომლები ჯირადან");
	ТЗ.Колонки.Добавить("თანამშრომლები", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"), "თანამშრომლები");
	
	Для каждого ТекСтрока Из СотрудникиИзДжираИНеИзДжира.спДжира Цикл
	    НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.თანამშრომლები_ჯირადან = ТекСтрока.Значение;
	КонецЦикла;
	
	Для каждого ТекСтрока Из СотрудникиИзДжираИНеИзДжира.спНеДжира Цикл
	    НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.თანამშრომლები = ТекСтрока.Значение;
	КонецЦикла;
		
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(ТЗ);       
	Построитель.Вывести(ТабДокумент); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументы(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьДокументыЗавершение", ЭтаФорма), "მოხდეს დოკუმენტების წაშლაზე მონიშვნა?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьДокументыНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыНаСервере()
	
	Попытка
		
		Для каждого ТекСтрока Из ДокументыНачислений Цикл
			ДокОбъ = ТекСтрока.ДокументСсылка.ПолучитьОбъект();		
			ДокОбъ.УстановитьПометкуУдаления(Истина);
			ДокОбъ.Записать();		
		КонецЦикла;
		
		Для каждого ТекСтрока Из ДокументыПлатежнаяВедомость Цикл
			ДокОбъ = ТекСтрока.ДокументСсылка.ПолучитьОбъект();		
			ДокОбъ.УстановитьПометкуУдаления(Истина);
			ДокОбъ.Записать();		
		КонецЦикла;
		
		Для каждого ТекСтрока Из ДокументыРасходСоСчета Цикл
			ДокОбъ = ТекСтрока.ДокументСсылка.ПолучитьОбъект();		
			ДокОбъ.УстановитьПометкуУдаления(Истина);
			ДокОбъ.Записать();		
		КонецЦикла;		
		
	Исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДокументовЗарплатыДжира(Команда)
	
	Если ЗначениеЗаполнено(Объект.ПериодРегистраций) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОбновлениеДокументовЗарплатыДжираЗавершение", ЭтаФорма), "მოხდეს არჩეული პერიოდით (" + НачалоМесяца(Объект.ПериодРегистраций) + ") ჯირას დოკუმენტების განახლება? ", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДокументовЗарплатыДжираЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьСообщения();
		ОбновлениеДокументовЗарплатыДжираНаСервере();
		Сообщить("დასრულდა.");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновлениеДокументовЗарплатыДжираНаСервере()
	
	М = Новый Массив;
	М.Добавить(Справочники.AzRyНастройки.УдержаниеНДФЛ.Значение);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СтатусОбработки = "Обновление";
	ОбработкаОбъект.ПараметрыЗапускаCC();
	ОбработкаОбъект.ТипНачисленияJiraТариф = "jira";
	ОбработкаОбъект.ДатаДокумента = КонецМесяца(ОбработкаОбъект.ПериодРегистраций);
	ОбработкаОбъект.ТабличнаяЧастьСотрудники.Очистить();
	ОбработкаОбъект.ТабличнаяЧастьСотрудникиНалог.Очистить();
	ОбработкаОбъект.ИсторияСотрудника.Очистить();
	
	НачатьТранзакцию();
	Попытка
		Ответ = ОбработкаОбъект.ОбработкаДокументовНачисленияЗаПериод2(НачалоМесяца(ОбработкаОбъект.ПериодРегистраций), КонецМесяца(ОбработкаОбъект.ПериодРегистраций));				
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНачисленийНачисленоПриИзменении(Элемент)
	ОбновитьПодвалТаблиц();	
КонецПроцедуры

Процедура ОбновитьПодвалТаблиц()

	Элементы.ДокументыНачисленийНачислено.ТекстПодвала = ДокументыНачислений.Итог("Начислено");
	Элементы.ДокументыНачисленийУдержано.ТекстПодвала = ДокументыНачислений.Итог("Удержано");
	Элементы.ДокументыНачисленийСуммаВыдачи.ТекстПодвала = ДокументыНачислений.Итог("СуммаВыдачи");
	
	Элементы.ДокументыПлатежнаяВедомостьСуммаДокумента.ТекстПодвала = ДокументыПлатежнаяВедомость.Итог("СуммаДокумента");
	Элементы.ДокументыРасходСоСчетаСуммаДокумента.ТекстПодвала = ДокументыРасходСоСчета.Итог("СуммаДокумента");

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	РеквизитФормыВЗначение("Объект").Подразделение.ЗагрузитьЗначения(СтруктурнаяЕдиница.ВыгрузитьЗначения());	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
